{

// ----------------------------------------------------------------------------
// items
	
// http://localhost:5000/api/parser/nzeta?method=items&artikul=zeta10710

[{
	"id":"10393",
	"name":"Т  2,5-4-2,6 (уп.100/1500/9000 шт) ЗЭТАРУС",
	"guid":"4fd738b2-9bbf-11db-acf6-001485e6b57c",
	"parentguid":"119b2774-9fb2-11db-acf6-001485e6b57c",
	"artikul":"zeta10710",
	"category":"Z (Заказ под заказ)",
	"TNVED":"8535900008",
	"sertRequired":"1",
	"volumeNumerator":"0.403",
	"volumeDenominator":"1000000.000",
	"weightNumerator":"0.003",
	"weightDenominator":"1.000",
	"edIzm":"шт",
	"volumeEdIzm":"кг",
	"inPrice":"1",
	"barcode":""
}]


// ----------------------------------------------------------------------------
// structure

// s_id = guid из метода "items"
// http://localhost:5000/api/parser/nzeta?method=structure&s_id=4fd738b2-9bbf-11db-acf6-001485e6b57c

[{
	"id":"5277",
	"s_id":"4fd738b2-9bbf-11db-acf6-001485e6b57c",
	"p_id":"109",
	"name":"Т  2,5-4-2,6 (уп.100/1500/9000 шт) ЗЭТАРУС",
	"site":"2"
}]


// ----------------------------------------------------------------------------
// properties_group

// cat_id = parentguid из метода "items"
// http://localhost:5000/api/parser/nzeta?method=properties_group&cat_id=119b2774-9fb2-11db-acf6-001485e6b57c

[{
	"id":"13",
	"parent":"0",
	"nas":"0",
	"cat_id":`[
		"a805e685-1aaf-11df-911a-001a9238f1db",
		"119b2774-9fb2-11db-acf6-001485e6b57c",
		"0023ea0c-5433-11e8-827f-001e67657cbf",
		"119b2766-9fb2-11db-acf6-001485e6b57c",
		"58d94c4b-39bb-11eb-ba8c-ac1f6b74a363"
	]`,
	"name":"Наконечники и гильзы под опрессовку"
}]


// ----------------------------------------------------------------------------
// properties

// g_id = id из "properties_group", но site = 1 !!!!!
// http://localhost:5000/api/parser/nzeta?method=properties&g_id=13&site=1

[
	{"id":"22","act":"1","g_id":"[\"1\",\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Вид изделия","type":"2","p_type":"5","mask":"0","site":"1","code":"VID_IZDELIYA_1","sort":"0"},
	{"id":"47","act":"1","g_id":"[\"1\",\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Код ОКП","type":"2","p_type":"5","mask":"0","site":"1","code":"KOD_OKP","sort":"6"},
	{"id":"48","act":"1","g_id":"[\"5\",\"13\"]","name":"Метод монтажа","type":"2","p_type":"5","mask":"0","site":"1","code":"METOD_MONTAZHA","sort":"0"},
	{"id":"50","act":"1","g_id":"[\"5\",\"6\",\"13\"]","name":"Рабочее напряжение","type":"2","p_type":"5","mask":"0","site":"1","code":"RABOCHEE_NAPRYAZHENIE","sort":"0"},
	{"id":"51","act":"1","g_id":"[\"5\",\"9\",\"10\",\"11\",\"13\"]","name":"Размер d1, мм","type":"2","p_type":"5","mask":"0","site":"1","code":"RAZMER_D1","sort":"2"},
	{"id":"52","act":"1","g_id":"[\"2\",\"5\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Размер d2, мм","type":"2","p_type":"5","mask":"0","site":"1","code":"RAZMER_D2","sort":"3"},
	{"id":"61","act":"1","g_id":"[\"5\",\"13\"]","name":"Диаметр контактного стержня, мм","type":"2","p_type":"5","mask":"0","site":"1","code":"DIAMETR_KONTAKTNOGO_STERZHNYA","sort":"0"},
	{"id":"63","act":"1","g_id":"[\"2\",\"5\",\"8\",\"9\",\"11\",\"13\"]","name":"Наличие покрытия","type":"2","p_type":"5","mask":"0","site":"1","code":"NALICHIE_POKRYTIYA","sort":"0"},
	{"id":"99","act":"1","g_id":"[\"2\",\"5\",\"10\",\"12\",\"13\"]","name":"Модель/исполнение","type":"2","p_type":"5","mask":"0","site":"1","code":"MODEL_ISPOLNENIE","sort":"0"},
	{"id":"106","act":"1","g_id":"[\"5\",\"13\"]","name":"Размер B, мм","type":"2","p_type":"5","mask":"0","site":"1","code":"RAZMER_B","sort":"2"},
	{"id":"137","act":"1","g_id":"[\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"YouTube","type":"2","p_type":"5","mask":"0","site":"1","code":"YOUTUBE","sort":"0"},
	{"id":"149","act":"1","g_id":"[\"13\"]","name":"Размер I, мм","type":"2","p_type":"5","mask":"0","site":"1","code":"RAZMER_I","sort":"0"},
	{"id":"154","act":"1","g_id":"[\"13\"]","name":"Тип контакта","type":"2","p_type":"5","mask":"0","site":"1","code":"TIP_KONTAKTA","sort":"0"},
	{"id":"170","act":"1","g_id":"[\"2\",\"5\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Цвет","type":"2","p_type":"5","mask":"0","site":"1","code":"TSVET","sort":"4"},
	{"id":"180","act":"1","g_id":"[\"2\",\"5\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Материал","type":"2","p_type":"5","mask":"0","site":"1","code":"MATERIAL","sort":"0"},
	{"id":"190","act":"1","g_id":"[\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Бренд","type":"2","p_type":"5","mask":"0","site":"1","code":"BREND","sort":"0"},
	{"id":"200","act":"1","g_id":"[\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Класс ETIM","type":"2","p_type":"5","mask":"0","site":"1","code":"ETIM_CLASS","sort":"0"},
	{"id":"201","act":"1","g_id":"[\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Группа ETIM","type":"2","p_type":"5","mask":"0","site":"1","code":"ETIM_GROUP","sort":"0"},
	{"id":"207","act":"1","g_id":"[\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Тип изделия","type":"2","p_type":"5","mask":"0","site":"1","code":"TIP_IZDELIYA_1","sort":"0"},
	{"id":"222","act":"1","g_id":"[\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Климатическое исполнение","type":"2","p_type":"5","mask":"0","site":"1","code":"KLIMATICHESKOE_ISPOLNENIE","sort":"0"},
	{"id":"223","act":"1","g_id":"[\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Изготавливается по","type":"2","p_type":"5","mask":"0","site":"1","code":"IZGOTAVLIVAETSYA_PO","sort":"0"},
	{"id":"225","act":"1","g_id":"[\"2\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\"]","name":"Сертификат","type":"2","p_type":"5","mask":"0","site":"1","code":"SERTIFIKAT","sort":"0"},
	{"id":"245","act":"1","g_id":"[\"2\",\"5\",\"9\",\"10\",\"11\",\"13\"]","name":"Номинальное сечение, мм²","type":"1","p_type":"5","mask":"0","site":"1","code":"NOMINALNOE_SECHENIE","sort":"0"},
	{"id":"247","act":"1","g_id":"[\"2\",\"5\",\"9\",\"10\",\"11\",\"13\"]","name":"Диапазон диаметров кабеля, мм","type":"1","p_type":"5","mask":"0","site":"1","code":"DIAPAZON_DIAM_KABASDS","sort":"0"}
]



// ----------------------------------------------------------------------------
// properties_values - site = 1 !!!!!


// ----------------------------------------------------------------------------
// properties_items - site = 1 !!!!!



// ----------------------------------------------------------------------------
// items_description

// как мне найти описание для "id":"5277"??????
// http://localhost:5000/api/parser/nzeta?method=items_description&d_id=5277

[{}]


// ----------------------------------------------------------------------------
// structure

// http://localhost:5000/api/parser/nzeta?method=structure&s_id=109

[
	{"id":"5263", "s_id":"109","p_id":"103","name":"Т (медные)","site":"2"},
	{"id":"5471", "s_id":"109","p_id":"102","name":"Концевые","site":"2"},
	{"id":"5640", "s_id":"109","p_id":"101","name":"Муфты 3,4,5 ПСТ-1","site":"2"},
	{"id":"5779", "s_id":"109","p_id":"106","name":"Муфты 1 ПКВТ-10","site":"2"},
	{"id":"10265","s_id":"109","p_id":"103","name":"Держатель шин заземления К188У2","site":"2"}
]

// ----------------------------------------------------------------------------
// structure_description

// d_id = id из метода "structure"
// http://localhost:5000/api/parser/nzeta?method=structure_description&d_id=5263

[{
	"id":"152",
	"d_id":"5263",
	"descr":
		`<ul class="features">\r\n\t
			<li>Соответствуют требованиям ГОСТ 7386-80</li>\r\n\t
			<li>Изготовлены из меди М2</li>\r\n
		</ul>\r\n
		<p class="bodytext">\r\n 
			<b>Наконечники кабельные медные Т</b> используются для оконцевания проводов и кабелей с медными жилами сечением от 4 до 240 мм² и применяются для кабелей напряжением до 35 кВ. Наконечники закрепляются на жилах опрессовкой.\r\n
		</p>\r\n
		<p class="bodytext">\r\n\t 
			Наконечники Т изготавливаются из медной трубы марки М2. Наконечник одевается на жилу кабеля и опрессовывается гидравлическим или ручным прессом. Такой метод жестко скрепляет наконечник и жилу кабеля, обеспечивая надежный контакт.\r\n
		</p>\r\n
		<p>\r\n\t
			<img width="100%" src="https://nzeta.ru/upload/medialibrary/0d7/0d7ac5533768b04967414a15255f7685.jpg">\r\n
		</p>`
}]



}





























/*

[{"id":"5263","s_id":"109","p_id":"103","name":"Т (медные)","site":"2"}]

[{"id":"10246","s_id":"103","p_id":"101","name":"Медные наконечники и гильзы","site":"2"}]

[{"id":"5201","s_id":"101","p_id":"0","name":"Наконечники, гильзы и соединители","site":"2"}]

*/

